# Curve Intersect Result Class

Source: https://www.revitapidocs.com/2026/dcc60ee9-2d65-5843-5aa1-58f9797b178e.htm

---

| Curve Intersect Result Class |
| --- |

Contains the result of intersecting two curves and, if requested, a description of points where the two curves overlap or intersect. Inheritance Hierarchy System Object
Autodesk.Revit.DB CurveIntersectResult

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class CurveIntersectResult : IDisposable
```

```
Public Class CurveIntersectResult
	Implements IDisposable
```

```
public ref class CurveIntersectResult : IDisposable
```

```
type CurveIntersectResult =
    class
        interface IDisposable
    end
```
The CurveIntersectResult type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Result | The classification of intersection or overlap between the two curves. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveIntersectResult |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetOverlaps | Gets information about the points shared between the two curves. |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace